Revit 2027 API
Water.WaterType Property
 The property labeled "Type" from the "Water" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string WaterType { get; }
Public Shared ReadOnly Property WaterType As String
	Get
public:
static property String^ WaterType {
	String^ get ();
}
static member WaterType : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "WaterType".
See Also
Reference
Water Class
Autodesk.Revit.DB.Visual Namespace